const Goal = () => {
    return (
    <div className="goalSection">
        <b>Тема:</b> АІС прокату автомобілів
        <p>
            <b>Мета проекту:</b> знайти найближчу станцію оренди автомобіля, оформити оренду, обрати авто за технічними характеристиками
            (модель, марка авто, кількість місць для сидіння, тип палива, тип КПП)
        </p>
        <b>Сценарій використання сайту:</b>
        <ul>
            <li type="none">Користувач отримує перелік найближчих станцій оренди;</li>
            <li type="none">Користувач обирає авто;</li>
            <li type="none">Система перевіряє баланс користувача;</li>
            <li type="none">Користувач підтверджує/скасовує оренду;</li>
            <li type="none">Система формує замовлення;</li>
            <li type="none">Користувач оплачує замовлення;</li>
            <li type="none">Система надає доступ до авто;</li>
            <li type="none">По завершенню подорожі перевіряється стан авто та заноситься до списку станції прибуття</li>
        </ul>
    </div>
    );
    }


const Desc = () => {
    return (
        <h2>Веб сайт прокату автомобілів</h2>
    );
}


export const descriptionDictLW1 = {
    'describe': <Desc/>,
    'goal': <Goal/>
}

