const Desc = () => {
    return (
    <p>
        <b>Тема:</b> АІС прокату автомобілів

        Мета проекту: знайти найближчу станцію оренди автомобіля, оформити оренду, обрати авто за технічними характеристиками (модель, марка авто, кількість місць для сидіння, тип палива, тип КПП)

        Сценарій використання сайту:
        Користувач отримує перелік найближчих станцій оренди;
        Користувач обирає авто;
        Система перевіряє баланс користувача;
        Користувач підтверджує/скасовує оренду;
        Система формує замовлення;
        Користувач оплачує замовлення;
        Система надає доступ до авто;
        По завершенню подорожі перевіряється стан авто та заноситься до списку станції прибуття
    </p>);
    }

export const descriptionDictLW1 = {
    'describe': <Desc/>
}

