import React from 'react';
import '../../../styles/task2block.css'
import '../../../styles/task2table.css'
import * as rawCode from './rawCode.jsx';


const Goal = () => {
    return (
        <>
        <b>Тема:</b> АДАПТИВНА ВЕРСТКА. МЕДІА-ЗАПИТИ. МЕТАТЕГ VIEWPORT.
        <p>
        <b>Мета:</b>
        <ul className="listLw1">
            <li>придбати практичні навички роботи з адаптивною версткою, медіа-запитами, медіа-типами, медіа-функціями;</li>
            <li>придбати практичні навички роботи з метатегом Viewport, розібратись з інструментами розробника та стратегією Mobile First.</li>
        </ul>
        </p>
        <a target="_blank" rel="noreferrer" href="https://github.com/dyadya666/zpi-zp41_appWEB-ChepurnovSerhii-MEU-2025">Посилання на репозиторій власного WEB-застосунку</a>
        <br /><a target="_blank" rel="noreferrer" href="https://dyadya666.github.io/zpi-zp41_appWEB-ChepurnovSerhii-MEU-2025/">Посилання на живу сторінку власного WEB-застосунку</a>
        <br />
        <br /><a target="_blank" rel="noreferrer" href="https://github.com/dyadya666/zpi-zp41_appRECORD-ChepurnovSerhii-MEU-2025">Посилання на репозиторій звітного HTML-документа</a>
        <br /><a target="_blank" rel="noreferrer" href="https://dyadya666.github.io/zpi-zp41_appRECORD-ChepurnovSerhii-MEU-2025/">Посилання на живу сторінку звітного HTML-документ</a>
        <br />
        <br /><a target="_blank" rel="noreferrer" href="https://github.com/dyadya666/zpi-zp41_appINDEPENDENT-ChepurnovSerhii-MEU-2025">Посилання на репозиторій з самостійними роботами</a>
        <br /><a target="_blank" rel="noreferrer" href="https://dyadya666.github.io/zpi-zp41_appINDEPENDENT-ChepurnovSerhii-MEU-2025/">Посилання живу сторінку з самостійними роботами</a>

        </>
    );
    }

const Desktop = () => {
    return (
        <>
        <h2>Десктопна версія</h2>
            <p>Десктопна версія веб-сайту або програми зазвичай адаптована для великих екранів,
                таких як монітори комп'ютерів або ноутбуків.</p>
            <h2>Основні характеристики десктопної версії</h2>
            <ul>
                <li><strong>Розмір екрану</strong>: Десктопні версії оптимізовані для екранів з великою роздільною здатністю, зазвичай від <b>1024px</b> і більше.</li>
                <li><strong>Навігація</strong>: Меню навігації часто розташоване вгорі або збоку, що забезпечує легкий доступ до всіх розділів веб-сайту або програми.</li>
                <li><strong>Макет</strong>: Десктопні версії зазвичай використовують багато колонок і великий простір для 
                розміщення контенту, що дозволяє легко відображати текст, зображення, графіки та інші елементи.</li>
                <li><strong>Інтерактивність</strong>: Всі інтерактивні елементи, такі як кнопки, форми і посилання,
                оптимізовані для використання з мишею та клавіатурою.</li>
            </ul>

        <h2>Принципи адаптивного дизайну</h2>
            <p><strong>Гнучкість</strong>: Десктопна версія повинна адаптуватися до різних розмірів екранів, щоб 
            забезпечити гарний вигляд на різних пристроях.</p>
            <p><strong>Медіа-запити</strong>: CSS медіа-запити використовуються для налаштування макету і стилів залежно від розміру екрану.</p>
            <p><strong>Зміна розміру шрифтів та елементів</strong>: Шрифти, зображення та інші елементи можуть 
            змінювати свої розміри в залежності від розміру екрану для покращення читабельності та зручності користування.</p>
            
        <h2>Переваги десктопної версії</h2>
            <ul>
                <li><strong>Зручність у користуванні</strong>: Великі екрани дозволяють розміщувати багато інформації на одній сторінці без необхідності прокручування.</li>
                <li><strong>Більша продуктивність</strong>: Десктопні пристрої зазвичай мають більшу обчислювальну потужність, що дозволяє використовувати більш складні і ресурсоємні функції.</li>
                <li><strong>Краща візуалізація</strong>: Великі екрани дозволяють відображати високоякісні зображення, відео та графіки.</li>
            </ul>

        <h4>CSS-код</h4>
            <pre>{rawCode.rawDesktop}</pre>
        </>
    );
}

const Tablet = () => {
    return (
        <>
            <h2>Планшетна версія</h2>
            <p>Планшетна версія веб-сайту або програми зазвичай адаптована для екранів середнього розміру,
                таких як планшети.</p>

            <h2>Основні характеристики планшетної версії</h2>
            <ul>
                <li><strong>Розмір екрану</strong>: Планшетні версії оптимізовані для екранів з роздільною здатністю від <b>600px</b> до <b>900px.</b></li>
                <li><strong>Навігація</strong>: Меню навігації часто розташоване вгорі або збоку, забезпечуючи зручний доступ до всіх розділів веб-сайту або програми.</li>
                <li><strong>Макет</strong>: Планшетні версії зазвичай використовують одну або дві колонки для розміщення контенту, що забезпечує зручний перегляд.</li>
                <li><strong>Інтерактивність</strong>: Всі інтерактивні елементи, такі як кнопки, форми і посилання, оптимізовані для використання з сенсорним екраном.</li>
            </ul>

            <h2>Принципи адаптивного дизайну</h2>
            <p><strong>Гнучкість</strong>: Планшетна версія повинна адаптуватися до різних розмірів екрану, забезпечуючи гарний вигляд на різних пристроях.</p>
            <p><strong>Медіа-запити</strong>: CSS медіа-запити використовуються для налаштування макету і стилів залежно від розміру екрану.</p>
            <p><strong>Зміна розміру шрифтів та елементів</strong>: Шрифти, зображення та інші елементи можуть змінювати свої розміри в залежності від розміру екрану для покращення читабельності та зручності користування.</p>
            
            <h2>Переваги планшетної версії</h2>
            <ul>
                <li><strong>Зручність у користуванні</strong>: Планшетні екрани забезпечують хороший баланс між портативністю і розміром екрану, що дозволяє зручно користуватися веб-сайтом або програмою.</li>
                <li><strong>Сенсорний екран</strong>: Планшети оснащені сенсорними екранами, що робить інтерактивність більш інтуїтивною і простою.</li>
                <li><strong>Адаптивність</strong>: Планшетні версії забезпечують хороший користувацький досвід на різних пристроях завдяки адаптивному дизайну.</li>
            </ul>

        <h4>CSS-код</h4>
            <pre>{rawCode.rawTablet}</pre>
        </>
    );
}

const Mobile = () => {
    return (
        <>
            <h2>Мобільна версія</h2>
            <p>Мобільна версія веб-сайту або програми зазвичай адаптована для невеликих екранів смартфонів.</p>

            <h2>Основні характеристики мобільної версії</h2>
            <ul>
                <li><strong>Розмір екрану</strong>: Мобільні версії оптимізовані для екранів з роздільною здатністю менше <b>600px</b>.</li>
                <li><strong>Навігація</strong>: Меню навігації часто розташоване у вигляді "гамбургера", що дозволяє економити простір і забезпечує зручний доступ до всіх розділів веб-сайту або програми.</li>
                <li><strong>Макет</strong>: Мобільні версії зазвичай використовують одну колонку для розміщення контенту, що забезпечує зручний перегляд на невеликих екранах.</li>
                <li><strong>Інтерактивність</strong>: Всі інтерактивні елементи, такі як кнопки, форми і посилання, оптимізовані для використання з сенсорним екраном.</li>
            </ul>

            <h2>Принципи адаптивного дизайну</h2>
            <p><strong>Гнучкість</strong>: Мобільна версія повинна адаптуватися до різних розмірів екрану, забезпечуючи гарний вигляд на різних пристроях.</p>
            <p><strong>Медіа-запити</strong>: CSS медіа-запити використовуються для налаштування макету і стилів залежно від розміру екрану.</p>
            <p><strong>Зміна розміру шрифтів та елементів</strong>: Шрифти, зображення та інші елементи можуть змінювати свої розміри в залежності від розміру екрану для покращення читабельності та зручності користування.</p>
        
        <h4>CSS-код</h4>
            <pre>{rawCode.rawMobile}</pre>
        </>
    );
}

const Conclusions = () => {
    return (
        <>
        В ході проведення даної лабораторної роботи були придбані практичні навички роботи з адаптивною версткою,
        медіа-запитами, медіа-типами, медіа-функціями, а також з метатегом Viewport, розібратись з інструментами
        розробника та стратегією Mobile First.
        </>
    );
}

export const descriptionDictLW22 = {
    'goal': <Goal />,
    'desktop': <Desktop />,
    'tablet': <Tablet />,
    'mobile': <Mobile />,
    'conclusions': <Conclusions />
}

